# sapply 는 연산 속도가 느린 단점이 있음.
# 이를 보완하기 위한 vapply 함수가 있다.

i39 <- lapply(3:9, seq)
# [[1]]
# [1] 1 2 3

# [[2]]
# [1] 1 2 3 4

# [[3]]
# [1] 1 2 3 4 5

# [[4]]
# [1] 1 2 3 4 5 6

# [[5]]
# [1] 1 2 3 4 5 6 7

# [[6]]
# [1] 1 2 3 4 5 6 7 8

# [[7]]
# [1] 1 2 3 4 5 6 7 8 9

# fivenum : 다섯 수치 요약
# 최소값, 제1사부위수, 중앙값, 제3사분위수, 최댓값

sapply(i39, fivenum)
#     [,1] [,2] [,3] [,4] [,5] [,6] [,7]
# [1,]  1.0  1.0    1  1.0  1.0  1.0    1
# [2,]  1.5  1.5    2  2.0  2.5  2.5    3
# [3,]  2.0  2.5    3  3.5  4.0  4.5    5
# [4,]  2.5  3.5    4  5.0  5.5  6.5    7
# [5,]  3.0  4.0    5  6.0  7.0  8.0    9

va <- vapply(i39, fivenum, c(Min. = 0, "1st Qu." = 0, Median = 0, "3rd Qu." = 0, Max. = 0))
#         [,1] [,2] [,3] [,4] [,5] [,6] [,7]
# Min.     1.0  1.0    1  1.0  1.0  1.0    1
# 1st Qu.  1.5  1.5    2  2.0  2.5  2.5    3
# Median   2.0  2.5    3  3.5  4.0  4.5    5
# 3rd Qu.  2.5  3.5    4  5.0  5.5  6.5    7
# Max.     3.0  4.0    5  6.0  7.0  8.0    9

# matrix 형태로 출력
va2 <- vapply(i39, fivenum, matrix(c(Min. = 0, "1st Qu." = 0, Median = 0, "3rd Qu." = 0, Max. = 0)))

class(va)
# "matrix"
class(va2)
# "array"