# Vector c(a1,a2,a3,....)
a <- c(1,2,3,4,5)
b <- c("big", "data")
# > a
# [1] 1 2 3 4 5
# > b
# [1] "big"  "data"

c(1,2,4,7,9) + c(6,0,10,11,19)
# [1]  7  2 14 18 28

c(1,2,5) + c(1,9,2,3,4)
# Warning message:
#  In c(1, 2, 5) + c(1, 9, 2, 3, 4) :
#  longer object length is not a multiple of shorter object length
# 1,2,5,1,2 로 자리수 맟춰서 재배열되어 계산될 수 있다.

m <- rbind(c(1,2),c(3,4))
# rbind = row & bound, 행으로 묶기
# cbind = column & bound, 열로 묶기
#       [,1] [,2]
# [1,]    1    2
# [2,]    3    4
m[1,1] # 1
m[2,2] # 4
m[,2] # 2 4
m[,1] # 1 3
m[1,] # 1 2
m[2,] # 3 4

m + 1:4
# + 1:4 => 순서대로 1,2,3,4 를 더해라.
#       [,1] [,2]
# [1,]    2    5
# [2,]    5    8

y <- c(1,3,0,12)
y[c(1,3)] # 첫번째, 세번째 원소 출력 > 1, 0
y[2:4] # # 2,3,4번째 원소 출력 > 3,0,12
v <- 3:4
y[v]
y[-1] # 첫번째 원소값 제외하고 출력. > 3 0 12
y[-1:-2] # 첫번째,두번째 원소값 제외하고 출력, > 0 12

# vector의 길이가 길고, 마지막 원소를 모를때
x[5:length(x)] # 5부터 length까지 출력
x[-lenght(x)] # 마지막 원소를 제거

# sequence
seq(from=12,to=30,by=3) # 12~30까지 3씩 끊어서.. > 12 15 18 21 24 27 30
seq(from=1.1, to=2, length=10) # 1.1부터 2까지 10개로 쪼개서 출력. > 1.1 1.2 1.3 1.4 1.5 1.6 1.7 1.8 1.9 2.0

# repetition
rep(c(5,12,13),3) # 5,12,13을 3번 반복 > 5 12 13  5 12 13  5 12 13
rep(1:3, 2)
rep(c(5,12,13),each=3) # 각 원소를 각 3번씩 반복 >  5  5  5 12 12 12 13 13 13

x <- c(6,1:3,12)
x[x>5]
which(x*x>8) # 제곱값이 8보다 큰 원소들의 '위치' 반
